[
  {
    "author": "icefourthirtythree",
    "text": "Christopher Nolan directed a technically impressive, emotionally cold movie? CRISTOPHER NOLAN?? IM SHOCKED!!",
    "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Christopher Nolan directed a technically impressive, emotionally cold movie? CRISTOPHER NOLAN?? IM SHOCKED!!&lt;/p&gt;\n&lt;/div&gt;",
    "ups": 1485,
    "replies": [
      {
        "author": "Chumunga64",
        "text": "Someone described Nolan films \"people who give awkward hugs\" and boy is it apt",
        "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Someone described Nolan films &amp;quot;people who give awkward hugs&amp;quot; and boy is it apt&lt;/p&gt;\n&lt;/div&gt;",
        "ups": 107,
        "replies": [
          {
            "author": "Waterwhipinwizard",
            "text": "Uh. Interstellar?",
            "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Uh. Interstellar?&lt;/p&gt;\n&lt;/div&gt;",
            "ups": 4,
            "sentiment": {
              "positive": 0.08,
              "neutral": 0.85,
              "negative": 0.07,
              "global": "neutral"
            }
          }
        ],
        "sentiment": {
          "positive": 0.13,
          "neutral": 0.08,
          "negative": 0.79,
          "global": "negative"
        }
      },
      {
        "author": "prouvairejean",
        "text": "That was basically my takeaway from the movie. TLDR: It's a Christopher Nolan movie.\n\nI created a separate thread on this, but it was removed by the mods and I was told to post my thoughts in this thread instead, so here goes:\n\nI went into Tenet  knowing nothing about it. I'd avoided the trailers (not intentionally,  just haven't been to the cinema in the last few months, don't watch TV  with ads, and don't generally seek trailers out online), and wasn't even  sure what genre it was. Although I did see the poster and ran across a comment recently that speculated it might be a sequel to Inception.\n\n**SPOILERS**\n\n&gt;!It's not. But I think it is fair to consider it a companion piece to Inception. It shares many traits with Inception and/or other Christopher Nolan films. These include, in no particular order:!&lt;\n\n* &gt;!playing with the concept of time and narrative chronology!&lt;\n* &gt;!a hallway fight that demonstrates the central \"gimmick\" of the movie!&lt;\n* &gt;!characters  talking about their backstory, interspersed with very brief flashbacks  showing us what they're saying (really leaning into the \"flash\" in  flashback)!&lt;\n* &gt;!lifestyles of the rich and famous!&lt;\n* &gt;!men in tailored suits and slicked back hair!&lt;\n* &gt;!men in masks, making it difficult to understand what they're saying (although it's not as bad in Tenet as Bane in TDKR before they went and adjusted his sound mix)!&lt;\n* &gt;!an, at times, overpowering soundscape (music and sound design)!&lt;\n* &gt;!my cocaine!&lt;\n* &gt;!a  dearth of female characters (I counted four women with speaking lines,  three of whom are there for exposition, and only two of whom have any  significant screen time)!&lt;\n* &gt;!the  central emotional throughline (such as it is) expressed primarily by  the main female character through her relationship with the main  character!&lt;\n* &gt;!elaborate  heists, or heist-like action set pieces featuring planes, cars, trucks  and automatic weapons - nothing is ever simple in a Nolan movie!&lt;\n* &gt;!a dash of metafiction!&lt;\n* &gt;!an opening sequence that serves as an audition of sorts!&lt;\n* &gt;!the idea of death being an escape out of an alternate reality (not really the major plot point in Tenet that it was in Inception, but it comes into play early on for a bit)!&lt;\n\n&gt;!There are undoubtedly more recurring motifs, but these are the main ones I noticed.!&lt;\n\n&gt;!As the above list might suggest, Tenet  felt familiar. Nolan clearly likes to play with his toys, and is  fascinated with the concept of time, whether it be in a non-fantastical  genre (Memento, Dunkirk) or science fiction (Inception, Interstellar). His narrative structures are often complex, even convoluted, to illustrate his films' premise. That's certainly true of Tenet, and not unusual in a story involving time travel.!&lt;\n\n&gt;!But I think Tenet  ends up being too clever (or silly) for its own good. The \"gimmick\" in  the story is expressed through the conceit of \"inverted\" objects,  objects sent back in time and which - upon arrival - somehow run  backwards in contravention to normal entropy. So a bullet might leave a  hole in a glass before it's fired. Or a car might find itself flipped on  a road before it's flipped. It's a conceit that feels like one you  could just maybe get away with in a Golden Age or Silver Age era comic  book. But in a story that, like most Nolan movies, is ostensibly  grounded in reality (something that was one of the defining aspects of  his Batman movies for instance), it just doesn't come across as  plausible. I think Nolan is aware of this, cause he lampshades it by  having a Doctor Exposition tell the main character (and us) that he (we)  shouldn't try to make sense of it. Which is advice I eventually took to  heart. Because the device I think is essentially only there to allow  Nolan to put an unusual spin the big action sequences.!&lt;\n\n&gt;!And  there are many action sequences, most of them heists of some sort, all  delivered in typical Nolan style: technically assured, eschewing visual  effects in favour of practical effects when possible (there's one  involving a Boeing 747 and I'm willing to bet that Nolan used a real  plane instead of CGI), but also sometimes confusing. There are two  sequences that suffered most in this last regard. One was the opening,  where I had some problems following the beats (something that was not an issue in other - better - Nolan opening heists, like the ones in The Dark Knight, The Dark Knight Rises or even Inception).  The other was the climax, which quite frankly I thought was a mess.  Just hundreds of men running, yelling, shooting at things (not exactly  what) and blowing things up (or whatever the opposite is of blowing  things up in time-reversed action), while there was a \"B\" line following  two characters, and a \"C\" line following two more. There was even an  introductory briefing to the big climax (in fact, laying out the plan  before seeing it executed is a trope used multiple times in the film)  which is supposed to explain everything about the mission, like the fact  that there were two teams, one normal and one inverted. But ultimately,  this sequence just failed to cohere for me, and I watched with detached  interest at best, and boredom at worst.!&lt;\n\n&gt;!There  were other sequences where we revisit previous scenes from another  perspective. These were better handled, but the idea is one we've seen  before and so didn't come as a particular surprise (even the movie's  title serves as foreshadowing), whether in science fiction short stories  (eg Heinlein's \"All You Zombies\", later adapted as the movie Predestination), comic books (Alan Moore's Chronocops) or other movies (eg Back to the Future).  That, by the way, isn't a criticism - after all there are very few  original ideas left, and those sequences themselves worked pretty well.!&lt;\n\n&gt;!I  think Nolan is fascinated with the time travel gimmick mainly for its  own sake. But I wish he had used it to better tell either an emotional  story or a more thematic one. There are some nods at both in Tenet. Elizabeth Debicki's character carries the emotional weight of the story, but it feels detached from the main idea. And, like Inception, which based the different characters' roles in the team on key film making roles, there is a metafictional aspect to Tenet.  In this case it involves the question of who is the protagonist (rather  awkwardly actually put in those terms: \"I'm the protagonist of this  story\" is an actual line in the film). Either the emotional throughline  or the more conceptual metafictional question could have been better  integrated into the story, but both are lost in the storm und drang of  Nolan's action sequences and narrative complexity.!&lt;\n\n&gt;!There's  not a lot to say about the acting. Everyone is fine or better. Debicki  does as much as she can with what she's given, and Kenneth Branagh most  easily rises above the material. I've long thought that Branagh is at  his best when he's playing bad guys, whether he's hamming it up  shamelessly (Wild Wild West) or providing nuance, warmth and appeal to the most horrific of people (Conspiracy).  He's always watchable as a villain no matter how good, bad or mediocre  the surrounding movie. He gives the most entertaining performance in Tenet, investing even hoary cliches like \"If I can't have you, no one will\" with intensity, and is probably the best thing about it.!&lt;\n\n&gt;!Random  thoughts: the opening sequence seems inspired by the 2002 Moscow  terrorist hostage crisis, and one of the characters' homes, an Indian  billionaire, seems clearly modelled on this real-life home of an actual Indian billionaire.!&lt;",
        "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;That was basically my takeaway from the movie. TLDR: It&amp;#39;s a Christopher Nolan movie.&lt;/p&gt;\n\n&lt;p&gt;I created a separate thread on this, but it was removed by the mods and I was told to post my thoughts in this thread instead, so here goes:&lt;/p&gt;\n\n&lt;p&gt;I went into Tenet  knowing nothing about it. I&amp;#39;d avoided the trailers (not intentionally,  just haven&amp;#39;t been to the cinema in the last few months, don&amp;#39;t watch TV  with ads, and don&amp;#39;t generally seek trailers out online), and wasn&amp;#39;t even  sure what genre it was. Although I did see the poster and ran across a comment recently that speculated it might be a sequel to Inception.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;SPOILERS&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;span class=\"md-spoiler-text\"&gt;It&amp;#39;s not. But I think it is fair to consider it a companion piece to Inception. It shares many traits with Inception and/or other Christopher Nolan films. These include, in no particular order:&lt;/span&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;span class=\"md-spoiler-text\"&gt;playing with the concept of time and narrative chronology&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span class=\"md-spoiler-text\"&gt;a hallway fight that demonstrates the central &amp;quot;gimmick&amp;quot; of the movie&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span class=\"md-spoiler-text\"&gt;characters  talking about their backstory, interspersed with very brief flashbacks  showing us what they&amp;#39;re saying (really leaning into the &amp;quot;flash&amp;quot; in  flashback)&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span class=\"md-spoiler-text\"&gt;lifestyles of the rich and famous&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span class=\"md-spoiler-text\"&gt;men in tailored suits and slicked back hair&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span class=\"md-spoiler-text\"&gt;men in masks, making it difficult to understand what they&amp;#39;re saying (although it&amp;#39;s not as bad in Tenet as Bane in TDKR before they went and adjusted his sound mix)&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span class=\"md-spoiler-text\"&gt;an, at times, overpowering soundscape (music and sound design)&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span class=\"md-spoiler-text\"&gt;my cocaine&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span class=\"md-spoiler-text\"&gt;a  dearth of female characters (I counted four women with speaking lines,  three of whom are there for exposition, and only two of whom have any  significant screen time)&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span class=\"md-spoiler-text\"&gt;the  central emotional throughline (such as it is) expressed primarily by  the main female character through her relationship with the main  character&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span class=\"md-spoiler-text\"&gt;elaborate  heists, or heist-like action set pieces featuring planes, cars, trucks  and automatic weapons - nothing is ever simple in a Nolan movie&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span class=\"md-spoiler-text\"&gt;a dash of metafiction&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span class=\"md-spoiler-text\"&gt;an opening sequence that serves as an audition of sorts&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span class=\"md-spoiler-text\"&gt;the idea of death being an escape out of an alternate reality (not really the major plot point in Tenet that it was in Inception, but it comes into play early on for a bit)&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;span class=\"md-spoiler-text\"&gt;There are undoubtedly more recurring motifs, but these are the main ones I noticed.&lt;/span&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;span class=\"md-spoiler-text\"&gt;As the above list might suggest, Tenet  felt familiar. Nolan clearly likes to play with his toys, and is  fascinated with the concept of time, whether it be in a non-fantastical  genre (Memento, Dunkirk) or science fiction (Inception, Interstellar). His narrative structures are often complex, even convoluted, to illustrate his films&amp;#39; premise. That&amp;#39;s certainly true of Tenet, and not unusual in a story involving time travel.&lt;/span&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;span class=\"md-spoiler-text\"&gt;But I think Tenet  ends up being too clever (or silly) for its own good. The &amp;quot;gimmick&amp;quot; in  the story is expressed through the conceit of &amp;quot;inverted&amp;quot; objects,  objects sent back in time and which - upon arrival - somehow run  backwards in contravention to normal entropy. So a bullet might leave a  hole in a glass before it&amp;#39;s fired. Or a car might find itself flipped on  a road before it&amp;#39;s flipped. It&amp;#39;s a conceit that feels like one you  could just maybe get away with in a Golden Age or Silver Age era comic  book. But in a story that, like most Nolan movies, is ostensibly  grounded in reality (something that was one of the defining aspects of  his Batman movies for instance), it just doesn&amp;#39;t come across as  plausible. I think Nolan is aware of this, cause he lampshades it by  having a Doctor Exposition tell the main character (and us) that he (we)  shouldn&amp;#39;t try to make sense of it. Which is advice I eventually took to  heart. Because the device I think is essentially only there to allow  Nolan to put an unusual spin the big action sequences.&lt;/span&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;span class=\"md-spoiler-text\"&gt;And  there are many action sequences, most of them heists of some sort, all  delivered in typical Nolan style: technically assured, eschewing visual  effects in favour of practical effects when possible (there&amp;#39;s one  involving a Boeing 747 and I&amp;#39;m willing to bet that Nolan used a real  plane instead of CGI), but also sometimes confusing. There are two  sequences that suffered most in this last regard. One was the opening,  where I had some problems following the beats (something that was not an issue in other - better - Nolan opening heists, like the ones in The Dark Knight, The Dark Knight Rises or even Inception).  The other was the climax, which quite frankly I thought was a mess.  Just hundreds of men running, yelling, shooting at things (not exactly  what) and blowing things up (or whatever the opposite is of blowing  things up in time-reversed action), while there was a &amp;quot;B&amp;quot; line following  two characters, and a &amp;quot;C&amp;quot; line following two more. There was even an  introductory briefing to the big climax (in fact, laying out the plan  before seeing it executed is a trope used multiple times in the film)  which is supposed to explain everything about the mission, like the fact  that there were two teams, one normal and one inverted. But ultimately,  this sequence just failed to cohere for me, and I watched with detached  interest at best, and boredom at worst.&lt;/span&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;span class=\"md-spoiler-text\"&gt;There  were other sequences where we revisit previous scenes from another  perspective. These were better handled, but the idea is one we&amp;#39;ve seen  before and so didn&amp;#39;t come as a particular surprise (even the movie&amp;#39;s  title serves as foreshadowing), whether in science fiction short stories  (eg Heinlein&amp;#39;s &amp;quot;All You Zombies&amp;quot;, later adapted as the movie Predestination), comic books (Alan Moore&amp;#39;s Chronocops) or other movies (eg Back to the Future).  That, by the way, isn&amp;#39;t a criticism - after all there are very few  original ideas left, and those sequences themselves worked pretty well.&lt;/span&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;span class=\"md-spoiler-text\"&gt;I  think Nolan is fascinated with the time travel gimmick mainly for its  own sake. But I wish he had used it to better tell either an emotional  story or a more thematic one. There are some nods at both in Tenet. Elizabeth Debicki&amp;#39;s character carries the emotional weight of the story, but it feels detached from the main idea. And, like Inception, which based the different characters&amp;#39; roles in the team on key film making roles, there is a metafictional aspect to Tenet.  In this case it involves the question of who is the protagonist (rather  awkwardly actually put in those terms: &amp;quot;I&amp;#39;m the protagonist of this  story&amp;quot; is an actual line in the film). Either the emotional throughline  or the more conceptual metafictional question could have been better  integrated into the story, but both are lost in the storm und drang of  Nolan&amp;#39;s action sequences and narrative complexity.&lt;/span&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;span class=\"md-spoiler-text\"&gt;There&amp;#39;s  not a lot to say about the acting. Everyone is fine or better. Debicki  does as much as she can with what she&amp;#39;s given, and Kenneth Branagh most  easily rises above the material. I&amp;#39;ve long thought that Branagh is at  his best when he&amp;#39;s playing bad guys, whether he&amp;#39;s hamming it up  shamelessly (Wild Wild West) or providing nuance, warmth and appeal to the most horrific of people (Conspiracy).  He&amp;#39;s always watchable as a villain no matter how good, bad or mediocre  the surrounding movie. He gives the most entertaining performance in Tenet, investing even hoary cliches like &amp;quot;If I can&amp;#39;t have you, no one will&amp;quot; with intensity, and is probably the best thing about it.&lt;/span&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;span class=\"md-spoiler-text\"&gt;Random  thoughts: the opening sequence seems inspired by the 2002 Moscow  terrorist hostage crisis, and one of the characters&amp;#39; homes, an Indian  billionaire, seems clearly modelled on this real-life home of an actual Indian billionaire.&lt;/span&gt;&lt;/p&gt;\n&lt;/div&gt;",
        "ups": 75,
        "replies": [
          {
            "author": "Am_Idiotosaurus",
            "text": "SPOILERS AHEAD\n\nGreat review and I agree on most of your points  which, lacking knowledge myself, couldn't put into words.\n\nI however disagree with the emotional distancing from the characters or the story. Robert Pattison's seeming distance and in my view \"dropping out of nowhere\" align with the movies ending. He finally explains with that type of smile when someone is questioning what you're doing but you know exactly what it is and what they don't know. It's true he knew more than what he said all along, and it didn't matter if he told 'the protagonist'. At the end of the movie all his weird actions and dialogues, along with facial expressions, clicked for me as a long friend going on one last adventure with someone who doesn't even know him yet. \n\nLike one of the reviewers said, I'm sure I'll enjoy this a lot more once I see this some more times",
            "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;SPOILERS AHEAD&lt;/p&gt;\n\n&lt;p&gt;Great review and I agree on most of your points  which, lacking knowledge myself, couldn&amp;#39;t put into words.&lt;/p&gt;\n\n&lt;p&gt;I however disagree with the emotional distancing from the characters or the story. Robert Pattison&amp;#39;s seeming distance and in my view &amp;quot;dropping out of nowhere&amp;quot; align with the movies ending. He finally explains with that type of smile when someone is questioning what you&amp;#39;re doing but you know exactly what it is and what they don&amp;#39;t know. It&amp;#39;s true he knew more than what he said all along, and it didn&amp;#39;t matter if he told &amp;#39;the protagonist&amp;#39;. At the end of the movie all his weird actions and dialogues, along with facial expressions, clicked for me as a long friend going on one last adventure with someone who doesn&amp;#39;t even know him yet. &lt;/p&gt;\n\n&lt;p&gt;Like one of the reviewers said, I&amp;#39;m sure I&amp;#39;ll enjoy this a lot more once I see this some more times&lt;/p&gt;\n&lt;/div&gt;",
            "ups": 32,
            "replies": [
              {
                "author": "Nitz93",
                "text": "And he messed with him. When he \"first\" encountered an inverted material.",
                "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;And he messed with him. When he &amp;quot;first&amp;quot; encountered an inverted material.&lt;/p&gt;\n&lt;/div&gt;",
                "ups": 3,
                "replies": [],
                "sentiment": {
                  "positive": 0,
                  "neutral": 0,
                  "negative": 1,
                  "global": "negative"
                }
              }
            ],
            "sentiment": {
              "positive": 0.4,
              "neutral": 0.01,
              "negative": 0.59,
              "global": "mixed"
            }
          },
          {
            "author": "mmicoandthegirl",
            "text": "Yeah the terrorist event is clearly inspired by real events. They put up carfentanil in the ventilation system and used narcan on the hostages while letting the terrorists die.",
            "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah the terrorist event is clearly inspired by real events. They put up carfentanil in the ventilation system and used narcan on the hostages while letting the terrorists die.&lt;/p&gt;\n&lt;/div&gt;",
            "ups": 3,
            "sentiment": {
              "positive": 0.01,
              "neutral": 0.01,
              "negative": 0.98,
              "global": "negative"
            }
          },
          {
            "author": "whitesweatshirt",
            "text": "Thank you for this!",
            "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for this!&lt;/p&gt;\n&lt;/div&gt;",
            "ups": 2,
            "sentiment": {
              "positive": 0.99,
              "neutral": 0.01,
              "negative": 0,
              "global": "positive"
            }
          },
          {
            "author": "beastmammoth",
            "text": "Nailed it",
            "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Nailed it&lt;/p&gt;\n&lt;/div&gt;",
            "ups": 2,
            "sentiment": {
              "positive": 0.93,
              "neutral": 0.06,
              "negative": 0.01,
              "global": "positive"
            }
          },
          {
            "author": "lindendweller",
            "text": "Disclaimer: I'm french, and I watched it with subtitles, and the disconnect between the lackluster translation and the original text made the dialogue much harder to follow than it usually is for me. As a result I might have missed some clarifying details.\n\nWith that said, the whole plot felt overly elaborate and rushed, leaving very little time to let the most challenging implications sink in. the results turns potential great Aha! moments into Uh what? moments.\n\nThe climax especially: I watched it with both my brother and sister, we brainstormed for an hour after leaving the film, and we still aren't sure how the villain's plan was supposed to work. As a result, while on a moment to moment basis the climactic sequence wasn't easy to follow (mostly because the geography isn't that well established without the crutch of the briefing,, and the enemies are barely shown), it was mostly hard to get invested into it in the first place.\n\nlike seriously,&gt;! how is a temporal capsule supposed to bring about the end, when the heroes would probably have ample time to recover the algorithm even if its sealed? What information exactly was the dead man switch supposed to make available to the enemy? is it the location of the algorithm?!&lt;\n\nwhile I have my gripes with the speed of the action and editing (robbing, at least for me, a lot of the impact of the most mind bending sequences) I think the movie (or at least the action sequences within) would have been especially better served by a clearer clash of protagonist and antagonist, without so many shadowy figures, double agents and so on.\n\nI believe we're meant to interpret many details, decode them and ponder their implications (i'm fairly confident that Kat's son is meant to become Neil) but it's hard to feel invested when the broad picture is so unclear.\n\nInception managed to have a surface level interpretation that was fairly easy to follow thanks to careful handholding, leaving people free to ponder whether or not &gt;!Cobb was stuck in a dream all along,!&lt; and what small details might mean, and I think Tenet fails on that level.",
            "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Disclaimer: I&amp;#39;m french, and I watched it with subtitles, and the disconnect between the lackluster translation and the original text made the dialogue much harder to follow than it usually is for me. As a result I might have missed some clarifying details.&lt;/p&gt;\n\n&lt;p&gt;With that said, the whole plot felt overly elaborate and rushed, leaving very little time to let the most challenging implications sink in. the results turns potential great Aha! moments into Uh what? moments.&lt;/p&gt;\n\n&lt;p&gt;The climax especially: I watched it with both my brother and sister, we brainstormed for an hour after leaving the film, and we still aren&amp;#39;t sure how the villain&amp;#39;s plan was supposed to work. As a result, while on a moment to moment basis the climactic sequence wasn&amp;#39;t easy to follow (mostly because the geography isn&amp;#39;t that well established without the crutch of the briefing,, and the enemies are barely shown), it was mostly hard to get invested into it in the first place.&lt;/p&gt;\n\n&lt;p&gt;like seriously,&amp;gt;! how is a temporal capsule supposed to bring about the end, when the heroes would probably have ample time to recover the algorithm even if its sealed? What information exactly was the dead man switch supposed to make available to the enemy? is it the location of the algorithm?!&amp;lt;&lt;/p&gt;\n\n&lt;p&gt;while I have my gripes with the speed of the action and editing (robbing, at least for me, a lot of the impact of the most mind bending sequences) I think the movie (or at least the action sequences within) would have been especially better served by a clearer clash of protagonist and antagonist, without so many shadowy figures, double agents and so on.&lt;/p&gt;\n\n&lt;p&gt;I believe we&amp;#39;re meant to interpret many details, decode them and ponder their implications (i&amp;#39;m fairly confident that Kat&amp;#39;s son is meant to become Neil) but it&amp;#39;s hard to feel invested when the broad picture is so unclear.&lt;/p&gt;\n\n&lt;p&gt;Inception managed to have a surface level interpretation that was fairly easy to follow thanks to careful handholding, leaving people free to ponder whether or not &lt;span class=\"md-spoiler-text\"&gt;Cobb was stuck in a dream all along,&lt;/span&gt; and what small details might mean, and I think Tenet fails on that level.&lt;/p&gt;\n&lt;/div&gt;",
            "ups": 2,
            "replies": [],
            "sentiment": {
              "positive": 0.22,
              "neutral": 0.01,
              "negative": 0.77,
              "global": "mixed"
            }
          }
        ],
        "sentiment": "none"
      },
      {
        "author": "Nocturnal_animal808",
        "text": "I think it's funny because it seems like some reviewers are just over it. I felt like Dunkirk was the same way but the nature of that film lends itself very well to Nolan's cold, detached style. Easily my favorite film from him because I always found his stuff lacking a soul. Like the films are made by scientists.",
        "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s funny because it seems like some reviewers are just over it. I felt like Dunkirk was the same way but the nature of that film lends itself very well to Nolan&amp;#39;s cold, detached style. Easily my favorite film from him because I always found his stuff lacking a soul. Like the films are made by scientists.&lt;/p&gt;\n&lt;/div&gt;",
        "ups": 480,
        "replies": [
          {
            "author": "dar343",
            "text": "He's not the best at writing dialogue. The movies that had the most emotion to them had amazing actors carrying the emotion (Interstellar, Inception) or were written by his brother (Prestige).",
            "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s not the best at writing dialogue. The movies that had the most emotion to them had amazing actors carrying the emotion (Interstellar, Inception) or were written by his brother (Prestige).&lt;/p&gt;\n&lt;/div&gt;",
            "ups": 312,
            "replies": [
              {
                "author": "Salmakki",
                "text": "I didn't actually know prestige was written by his brother but that might explain why it's my favorite movie and the other stuff he's done just comes off as \"pretty good\" for me",
                "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;I didn&amp;#39;t actually know prestige was written by his brother but that might explain why it&amp;#39;s my favorite movie and the other stuff he&amp;#39;s done just comes off as &amp;quot;pretty good&amp;quot; for me&lt;/p&gt;\n&lt;/div&gt;",
                "ups": 123,
                "replies": [
                  {
                    "author": "dar343",
                    "text": "There's a chance I'm giving Johnathan too much credit for The Prestige. Christopher has (co)written every movie he has directed except for Insomnia. Johnathan has co-written 5 of them.",
                    "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s a chance I&amp;#39;m giving Johnathan too much credit for The Prestige. Christopher has (co)written every movie he has directed except for Insomnia. Johnathan has co-written 5 of them.&lt;/p&gt;\n&lt;/div&gt;",
                    "ups": 111,
                    "replies": [
                      {
                        "author": "dev1359",
                        "text": "The Prestige is based on a book, so there's also that to keep in mind. Despite being my favorite movie of his, I think it's the only non-original work he's directed outside of the Batman movies.",
                        "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;The Prestige is based on a book, so there&amp;#39;s also that to keep in mind. Despite being my favorite movie of his, I think it&amp;#39;s the only non-original work he&amp;#39;s directed outside of the Batman movies.&lt;/p&gt;\n&lt;/div&gt;",
                        "ups": 73,
                        "replies": [
                          {
                            "author": "dar343",
                            "text": "Insomnia is an adaptation of a Norwegian movie",
                            "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Insomnia is an adaptation of a Norwegian movie&lt;/p&gt;\n&lt;/div&gt;",
                            "ups": 40,
                            "replies": [
                              {
                                "author": "varro-reatinus",
                                "text": "*copy",
                                "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;*copy&lt;/p&gt;\n&lt;/div&gt;",
                                "ups": 5
                              }
                            ]
                          },
                          {
                            "author": "raysofdavies",
                            "text": "It’s got a lot of significant changes from the book. The Nolans completely cut the entire present day framing device.",
                            "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;It’s got a lot of significant changes from the book. The Nolans completely cut the entire present day framing device.&lt;/p&gt;\n&lt;/div&gt;",
                            "ups": 8
                          },
                          {
                            "author": "thewafflestompa",
                            "text": "Wait. Nolan didn’t invent Batman? Source?",
                            "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Wait. Nolan didn’t invent Batman? Source?&lt;/p&gt;\n&lt;/div&gt;",
                            "ups": 11
                          }
                        ],
                        "sentiment": {
                          "positive": 0.83,
                          "neutral": 0,
                          "negative": 0.17,
                          "global": "positive"
                        }
                      }
                    ],
                    "sentiment": {
                      "positive": 0.11,
                      "neutral": 0.3,
                      "negative": 0.59,
                      "global": "negative"
                    }
                  }
                ],
                "sentiment": {
                  "positive": 1,
                  "neutral": 0,
                  "negative": 0,
                  "global": "positive"
                }
              },
              {
                "author": "Greaseball01",
                "text": "Memento has a lot of emotion and that emotion is sad.",
                "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Memento has a lot of emotion and that emotion is sad.&lt;/p&gt;\n&lt;/div&gt;",
                "ups": 3,
                "replies": [
                  {
                    "author": "WINTERMUTE-_-",
                    "text": "Written by his brother though.",
                    "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Written by his brother though.&lt;/p&gt;\n&lt;/div&gt;",
                    "ups": 2,
                    "replies": [],
                    "sentiment": {
                      "positive": 0.23,
                      "neutral": 0.61,
                      "negative": 0.16,
                      "global": "neutral"
                    }
                  }
                ],
                "sentiment": {
                  "positive": 0.01,
                  "neutral": 0.01,
                  "negative": 0.98,
                  "global": "negative"
                }
              },
              {
                "author": "ZionIsFat",
                "text": "His brother is also the creator and lead writer of Westworld, which has horrifically bad writing IMO (yes, even season 1). The production/acting/score is all terrific but the writing and dialogue on that show is offensively bad.",
                "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;His brother is also the creator and lead writer of Westworld, which has horrifically bad writing IMO (yes, even season 1). The production/acting/score is all terrific but the writing and dialogue on that show is offensively bad.&lt;/p&gt;\n&lt;/div&gt;",
                "ups": 12,
                "replies": [],
                "sentiment": {
                  "positive": 0,
                  "neutral": 0,
                  "negative": 1,
                  "global": "negative"
                }
              },
              {
                "author": "BruceKaneWayne",
                "text": "Interstellar is by far my favorite because of the characters and emotion. Dunkirk just felt like a slap in the face after Interstellar. I think I’ve finally adjusted my expectations for Tenet.",
                "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Interstellar is by far my favorite because of the characters and emotion. Dunkirk just felt like a slap in the face after Interstellar. I think I’ve finally adjusted my expectations for Tenet.&lt;/p&gt;\n&lt;/div&gt;",
                "ups": 2,
                "sentiment": {
                  "positive": 0.99,
                  "neutral": 0,
                  "negative": 0.01,
                  "global": "positive"
                }
              }
            ],
            "sentiment": {
              "positive": 0.5,
              "neutral": 0,
              "negative": 0.5,
              "global": "mixed"
            }
          },
          {
            "author": "itsamiamia",
            "text": "That is exactly what I liked about Dunkirk. \n\nNolan is technically proficient director, but his characters get in the way, especially if they're chatty. Whether it's perfunctory exposition or odd, robotic expressions, his dialogue makes the soullessness of his character's so apparent. Even his most emotional film, Interstellar, has some of the weirdest bits of dialogue I've seen in mainstream film.\n\nDunkirk's strength is the lack of dialogue. Nolan's characters work best as abstractions and not human beings.",
            "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;That is exactly what I liked about Dunkirk. &lt;/p&gt;\n\n&lt;p&gt;Nolan is technically proficient director, but his characters get in the way, especially if they&amp;#39;re chatty. Whether it&amp;#39;s perfunctory exposition or odd, robotic expressions, his dialogue makes the soullessness of his character&amp;#39;s so apparent. Even his most emotional film, Interstellar, has some of the weirdest bits of dialogue I&amp;#39;ve seen in mainstream film.&lt;/p&gt;\n\n&lt;p&gt;Dunkirk&amp;#39;s strength is the lack of dialogue. Nolan&amp;#39;s characters work best as abstractions and not human beings.&lt;/p&gt;\n&lt;/div&gt;",
            "ups": 170,
            "replies": [
              {
                "author": "TheBooHooBlues",
                "text": "Can you elaborate on the dialogue of Interstellar? I've only seen it once (when it was released), and enjoyed it, but not as much as Inception.",
                "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you elaborate on the dialogue of Interstellar? I&amp;#39;ve only seen it once (when it was released), and enjoyed it, but not as much as Inception.&lt;/p&gt;\n&lt;/div&gt;",
                "ups": 25,
                "replies": [
                  {
                    "author": "KontraEpsilon",
                    "text": "It's one of my favorite movies, but there are a few examples that really come across poorly (IMO):\n\n- Jessica Chastain's line where she interrupts herself and says \"he's been working with one hand no both hands behind his back\" is really awkward. Nobody really talks like that, and it doesn't help that she's not the strongest actress contexts like that.\n\n- The \"no, it's necessary\" line is another case of \"people don't talk like that.\"\n\n- The \"now is not the time for caution\" line in (IIRC) that same scene\n\n- People have complaints about the lines about love. I don't think those are so bad, but I can see the issue. \n\nIn the end it's just some George Lucas-like dialogue. Michael Caine, Mcconaughey, and Hathaway are mostly able to salvage them. Jessica Chastain is not.",
                    "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s one of my favorite movies, but there are a few examples that really come across poorly (IMO):&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Jessica Chastain&amp;#39;s line where she interrupts herself and says &amp;quot;he&amp;#39;s been working with one hand no both hands behind his back&amp;quot; is really awkward. Nobody really talks like that, and it doesn&amp;#39;t help that she&amp;#39;s not the strongest actress contexts like that.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The &amp;quot;no, it&amp;#39;s necessary&amp;quot; line is another case of &amp;quot;people don&amp;#39;t talk like that.&amp;quot;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The &amp;quot;now is not the time for caution&amp;quot; line in (IIRC) that same scene&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;People have complaints about the lines about love. I don&amp;#39;t think those are so bad, but I can see the issue. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;In the end it&amp;#39;s just some George Lucas-like dialogue. Michael Caine, Mcconaughey, and Hathaway are mostly able to salvage them. Jessica Chastain is not.&lt;/p&gt;\n&lt;/div&gt;",
                    "ups": 48,
                    "replies": [
                      {
                        "author": "Broseff164",
                        "text": "Another when the in the PTA meeting and the teacher (or whatever) casually drops \"You are a great pilot, Cooper. And you never got to be one\" casually when talking about his son. I know why it's there, it's just so blindingly obvious. The least subtle clue ever.",
                        "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Another when the in the PTA meeting and the teacher (or whatever) casually drops &amp;quot;You are a great pilot, Cooper. And you never got to be one&amp;quot; casually when talking about his son. I know why it&amp;#39;s there, it&amp;#39;s just so blindingly obvious. The least subtle clue ever.&lt;/p&gt;\n&lt;/div&gt;",
                        "ups": 29,
                        "sentiment": {
                          "positive": 0.5,
                          "neutral": 0.22,
                          "negative": 0.28,
                          "global": "mixed"
                        }
                      },
                      {
                        "author": "svrtngr",
                        "text": "Hans Zimmer's score also helps.\n\n\"No, it's necessary.\"\n\n*organ intensifies*",
                        "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Hans Zimmer&amp;#39;s score also helps.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;No, it&amp;#39;s necessary.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;organ intensifies&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;",
                        "ups": 12,
                        "sentiment": {
                          "positive": 0.99,
                          "neutral": 0.01,
                          "negative": 0,
                          "global": "positive"
                        }
                      },
                      {
                        "author": "TheBooHooBlues",
                        "text": "Cheers for the reply. Kind of want to give it another watch now, lol",
                        "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Cheers for the reply. Kind of want to give it another watch now, lol&lt;/p&gt;\n&lt;/div&gt;",
                        "ups": 3,
                        "replies": [
                          {
                            "author": "itsamiamia",
                            "text": "I will say that I very much like Interstellar, despite it's very serious flaws.\n\nWhen I think of awful dialogue in the film, I think [this scene](https://www.youtube.com/watch?v=sjBAhovvI38) has several examples. \"Evolution has yet to transcend that simple barrier\" makes me cringe every time I hear it.\n\nAnd since the other comment mentioned the emergency docking scene's \"No, it's necessary\" line... It's a strange response to someone saying something is not possible -- they are not mutually exclusive things. It'd still sound \"bad ass\" but more sensible if Cooper just said \"But it's necessary.\"",
                            "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;I will say that I very much like Interstellar, despite it&amp;#39;s very serious flaws.&lt;/p&gt;\n\n&lt;p&gt;When I think of awful dialogue in the film, I think &lt;a href=\"https://www.youtube.com/watch?v=sjBAhovvI38\"&gt;this scene&lt;/a&gt; has several examples. &amp;quot;Evolution has yet to transcend that simple barrier&amp;quot; makes me cringe every time I hear it.&lt;/p&gt;\n\n&lt;p&gt;And since the other comment mentioned the emergency docking scene&amp;#39;s &amp;quot;No, it&amp;#39;s necessary&amp;quot; line... It&amp;#39;s a strange response to someone saying something is not possible -- they are not mutually exclusive things. It&amp;#39;d still sound &amp;quot;bad ass&amp;quot; but more sensible if Cooper just said &amp;quot;But it&amp;#39;s necessary.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;",
                            "ups": 5
                          }
                        ],
                        "sentiment": {
                          "positive": 0.98,
                          "neutral": 0.01,
                          "negative": 0.01,
                          "global": "positive"
                        }
                      },
                      {
                        "author": "lindendweller",
                        "text": "to me the lines about love were not bad in and of themselves, but because they were jarring in the context of a fairly cold character. We don't see her husband, we don't see her relationship, the script doesn't really sell that emotional side of her before it comes into play.\n\nBut the worst has to be the Matt Damon philosophy thesis about self preservation: is the guy supposed to be a sociopath? manic with isolation? I'm not entirely sure, because the sociopath angle would have been better served with less self justification, and the manic angle with a completely different writing.",
                        "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;to me the lines about love were not bad in and of themselves, but because they were jarring in the context of a fairly cold character. We don&amp;#39;t see her husband, we don&amp;#39;t see her relationship, the script doesn&amp;#39;t really sell that emotional side of her before it comes into play.&lt;/p&gt;\n\n&lt;p&gt;But the worst has to be the Matt Damon philosophy thesis about self preservation: is the guy supposed to be a sociopath? manic with isolation? I&amp;#39;m not entirely sure, because the sociopath angle would have been better served with less self justification, and the manic angle with a completely different writing.&lt;/p&gt;\n&lt;/div&gt;",
                        "ups": 2,
                        "sentiment": {
                          "positive": 0.02,
                          "neutral": 0.02,
                          "negative": 0.96,
                          "global": "negative"
                        }
                      }
                    ],
                    "sentiment": {
                      "positive": 0.19,
                      "neutral": 0.09,
                      "negative": 0.72,
                      "global": "mixed"
                    }
                  }
                ],
                "sentiment": {
                  "positive": 0.97,
                  "neutral": 0,
                  "negative": 0.03,
                  "global": "positive"
                }
              }
            ],
            "sentiment": {
              "positive": 0.4,
              "neutral": 0.05,
              "negative": 0.55,
              "global": "mixed"
            }
          },
          {
            "author": "StaffSarntSaid",
            "text": "NYTIMES' Jessica Kiang is definitely over it:\n\n&gt;Indeed, take away the time-bending gimmick, and “Tenet\" is a series of timidly generic set pieces: heists, car chases, bomb disposals, more heists. **But then, the lie of Nolan’s career has been that he makes the traditionally teenage-boy-aimed blockbuster smarter and more adult, when what he really does is ennoble the teenage boy fixations many of us adults still cherish, creating vast, sizzling conceptual landscapes in which all anyone really does is crack safes and blow stuff up.**",
            "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;NYTIMES&amp;#39; Jessica Kiang is definitely over it:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Indeed, take away the time-bending gimmick, and “Tenet&amp;quot; is a series of timidly generic set pieces: heists, car chases, bomb disposals, more heists. &lt;strong&gt;But then, the lie of Nolan’s career has been that he makes the traditionally teenage-boy-aimed blockbuster smarter and more adult, when what he really does is ennoble the teenage boy fixations many of us adults still cherish, creating vast, sizzling conceptual landscapes in which all anyone really does is crack safes and blow stuff up.&lt;/strong&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;",
            "ups": 136,
            "replies": [
              {
                "author": "Elementium",
                "text": "I'm with her.. For *me*, Nolan is one tiny level below the greats. He makes *really* good movies that have fooled people into thinking there is a *deeper* intelligence than the regular cleverness of his films.",
                "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m with her.. For &lt;em&gt;me&lt;/em&gt;, Nolan is one tiny level below the greats. He makes &lt;em&gt;really&lt;/em&gt; good movies that have fooled people into thinking there is a &lt;em&gt;deeper&lt;/em&gt; intelligence than the regular cleverness of his films.&lt;/p&gt;\n&lt;/div&gt;",
                "ups": 80,
                "replies": [
                  {
                    "author": "[deleted]",
                    "text": "[effacé]",
                    "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;[effacé]&lt;/p&gt;\n&lt;/div&gt;",
                    "ups": 24,
                    "replies": [
                      {
                        "author": "Avreal",
                        "text": "I personally think someone can be great and make thematically similar movies. Not speaking in defense of Nolan here, but i love Hayao Miyazaki and his movies are definitely somewhat same-ish.",
                        "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;I personally think someone can be great and make thematically similar movies. Not speaking in defense of Nolan here, but i love Hayao Miyazaki and his movies are definitely somewhat same-ish.&lt;/p&gt;\n&lt;/div&gt;",
                        "ups": 5,
                        "sentiment": {
                          "positive": 0.99,
                          "neutral": 0,
                          "negative": 0.01,
                          "global": "positive"
                        }
                      }
                    ],
                    "sentiment": {
                      "positive": 0.01,
                      "neutral": 0.98,
                      "negative": 0.01,
                      "global": "neutral"
                    }
                  },
                  {
                    "author": "ConfusedAndDazzed",
                    "text": "It's the same story with Nolan over and over again, yet as time passes, his movies receive more praise.\n\nJust look at Inception.\n\nBeating a dead horse at this point - try a different approach.",
                    "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s the same story with Nolan over and over again, yet as time passes, his movies receive more praise.&lt;/p&gt;\n\n&lt;p&gt;Just look at Inception.&lt;/p&gt;\n\n&lt;p&gt;Beating a dead horse at this point - try a different approach.&lt;/p&gt;\n&lt;/div&gt;",
                    "ups": 44,
                    "sentiment": {
                      "positive": 0.47,
                      "neutral": 0,
                      "negative": 0.53,
                      "global": "mixed"
                    }
                  },
                  {
                    "author": "dexterpool",
                    "text": "I've been calling his films \"confusion masquerading as intelligence\" for years and been shouted down for doing so.",
                    "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been calling his films &amp;quot;confusion masquerading as intelligence&amp;quot; for years and been shouted down for doing so.&lt;/p&gt;\n&lt;/div&gt;",
                    "ups": 15,
                    "replies": [],
                    "sentiment": {
                      "positive": 0,
                      "neutral": 0.01,
                      "negative": 0.99,
                      "global": "negative"
                    }
                  },
                  {
                    "author": "varro-reatinus",
                    "text": "That \"one tiny level\" might as well be the distance from the earth to the moon.",
                    "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;That &amp;quot;one tiny level&amp;quot; might as well be the distance from the earth to the moon.&lt;/p&gt;\n&lt;/div&gt;",
                    "ups": 9,
                    "sentiment": {
                      "positive": 0,
                      "neutral": 0.01,
                      "negative": 0.99,
                      "global": "negative"
                    }
                  }
                ],
                "sentiment": {
                  "positive": 0.46,
                  "neutral": 0,
                  "negative": 0.54,
                  "global": "mixed"
                }
              },
              {
                "author": "[deleted]",
                "text": "Lmfao that’s so spot on and probably this sub loves Nolan.",
                "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Lmfao that’s so spot on and probably this sub loves Nolan.&lt;/p&gt;\n&lt;/div&gt;",
                "ups": 13,
                "replies": [
                  {
                    "author": "dvddesign",
                    "text": "Probably? More definitely. \n\nNolan makes some interesting stuff to be sure but outside of the Batman films none of them have felt necessary to watch a second time. They were pretty, they entertained me, but the gimmick each film posits only stands up one or two times. \n\nI’m hoping this one is simply because I like time travel movies that incentivize watching multiple times.",
                    "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Probably? More definitely. &lt;/p&gt;\n\n&lt;p&gt;Nolan makes some interesting stuff to be sure but outside of the Batman films none of them have felt necessary to watch a second time. They were pretty, they entertained me, but the gimmick each film posits only stands up one or two times. &lt;/p&gt;\n\n&lt;p&gt;I’m hoping this one is simply because I like time travel movies that incentivize watching multiple times.&lt;/p&gt;\n&lt;/div&gt;",
                    "ups": 7,
                    "sentiment": {
                      "positive": 0.45,
                      "neutral": 0.28,
                      "negative": 0.27,
                      "global": "mixed"
                    }
                  }
                ],
                "sentiment": {
                  "positive": 1,
                  "neutral": 0,
                  "negative": 0,
                  "global": "positive"
                }
              }
            ],
            "sentiment": {
              "positive": 0.15,
              "neutral": 0.04,
              "negative": 0.81,
              "global": "negative"
            }
          },
          {
            "author": "extropia",
            "text": "Agree.  To his credit Nolan seems to understand the importance of working well with talented actors and not being overbearing.  Most of his films are very cold but many of the performances in them have been brilliant and have provided the necessary amount of soul to make the film work.  \n\nIt's just... for all his virtuoso filmmaking, he can't seem to break out of this pattern of intellectually engaging but emotionally unrelatable films and it's not an insignificant fault.  I'm still glad he exists and i love watching his movies.",
            "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Agree.  To his credit Nolan seems to understand the importance of working well with talented actors and not being overbearing.  Most of his films are very cold but many of the performances in them have been brilliant and have provided the necessary amount of soul to make the film work.  &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s just... for all his virtuoso filmmaking, he can&amp;#39;t seem to break out of this pattern of intellectually engaging but emotionally unrelatable films and it&amp;#39;s not an insignificant fault.  I&amp;#39;m still glad he exists and i love watching his movies.&lt;/p&gt;\n&lt;/div&gt;",
            "ups": 13,
            "sentiment": {
              "positive": 0.74,
              "neutral": 0,
              "negative": 0.26,
              "global": "mixed"
            }
          },
          {
            "author": "[deleted]",
            "text": "Interstellar had heart and soul.",
            "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Interstellar had heart and soul.&lt;/p&gt;\n&lt;/div&gt;",
            "ups": 174,
            "replies": [
              {
                "author": "varro-reatinus",
                "text": "Interstellar had mawkish melodrama.",
                "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Interstellar had mawkish melodrama.&lt;/p&gt;\n&lt;/div&gt;",
                "ups": 188,
                "replies": [
                  {
                    "author": "Granito_Rey",
                    "text": "The love bit with Dr Catwoman was hokey and contrived, but the scene of Coop watching the letters from his daughter really got me when I watched it the first time",
                    "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;The love bit with Dr Catwoman was hokey and contrived, but the scene of Coop watching the letters from his daughter really got me when I watched it the first time&lt;/p&gt;\n&lt;/div&gt;",
                    "ups": 118,
                    "replies": [
                      {
                        "author": "Glamslammer",
                        "text": "Dr. Catwoman 😅",
                        "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Dr. Catwoman 😅&lt;/p&gt;\n&lt;/div&gt;",
                        "ups": 16,
                        "sentiment": {
                          "positive": 0.05,
                          "neutral": 0.94,
                          "negative": 0.01,
                          "global": "neutral"
                        }
                      },
                      {
                        "author": "Floor100",
                        "text": "Oh I actuslly kindve bought into it. My background is in science but I still believe in entertaining the supernatural like what she was doing. I always thought thats what he does best is balancing science and the emotional side. Idk lol",
                        "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh I actuslly kindve bought into it. My background is in science but I still believe in entertaining the supernatural like what she was doing. I always thought thats what he does best is balancing science and the emotional side. Idk lol&lt;/p&gt;\n&lt;/div&gt;",
                        "ups": 3,
                        "sentiment": {
                          "positive": 0.67,
                          "neutral": 0.03,
                          "negative": 0.3,
                          "global": "mixed"
                        }
                      },
                      {
                        "author": "sib2972",
                        "text": "DONT LET ME GO MURPH",
                        "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;DONT LET ME GO MURPH&lt;/p&gt;\n&lt;/div&gt;",
                        "ups": 4,
                        "sentiment": {
                          "positive": 0.11,
                          "neutral": 0.67,
                          "negative": 0.22,
                          "global": "neutral"
                        }
                      }
                    ],
                    "sentiment": {
                      "positive": 0.99,
                      "neutral": 0,
                      "negative": 0.01,
                      "global": "positive"
                    }
                  },
                  {
                    "author": "xenobuzz",
                    "text": "Agreed.  Nolan doesn't seem to understand how to present fully realized characters, and most of his film suffer from this emotional hollowness.",
                    "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Agreed.  Nolan doesn&amp;#39;t seem to understand how to present fully realized characters, and most of his film suffer from this emotional hollowness.&lt;/p&gt;\n&lt;/div&gt;",
                    "ups": 55,
                    "replies": [
                      {
                        "author": "serendippitydoo",
                        "text": "It's also like he knows what subtlety is but chooses not to do it when it counts. Everything has to be shown or outright explained, we aren't allowed to fill in gaps ourselves. That final scene of DKR was literally a repeat of Alfred's fantasy and we had to see Batman and Catwoman sipping espresso while they mug for the camera. \"Oh good, they're alive. I would have had no idea who Alfred was so happy to see unless I could also see them awkwardly turn around and reveal themselves.\"",
                        "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s also like he knows what subtlety is but chooses not to do it when it counts. Everything has to be shown or outright explained, we aren&amp;#39;t allowed to fill in gaps ourselves. That final scene of DKR was literally a repeat of Alfred&amp;#39;s fantasy and we had to see Batman and Catwoman sipping espresso while they mug for the camera. &amp;quot;Oh good, they&amp;#39;re alive. I would have had no idea who Alfred was so happy to see unless I could also see them awkwardly turn around and reveal themselves.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;",
                        "ups": 8,
                        "replies": [],
                        "sentiment": {
                          "positive": 0.44,
                          "neutral": 0.15,
                          "negative": 0.41,
                          "global": "mixed"
                        }
                      },
                      {
                        "author": "Boo_R4dley",
                        "text": "I don’t think Nolan experiences the normal range of human emotions, I also don’t think he experiences the normal human range of hearing which is why everything is BWAAAAAAAAM! He just can’t hear low frequencies so everything sounds fine to him.",
                        "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;I don’t think Nolan experiences the normal range of human emotions, I also don’t think he experiences the normal human range of hearing which is why everything is BWAAAAAAAAM! He just can’t hear low frequencies so everything sounds fine to him.&lt;/p&gt;\n&lt;/div&gt;",
                        "ups": 21,
                        "sentiment": {
                          "positive": 0.04,
                          "neutral": 0.16,
                          "negative": 0.8,
                          "global": "negative"
                        }
                      }
                    ],
                    "sentiment": {
                      "positive": 0,
                      "neutral": 0,
                      "negative": 1,
                      "global": "negative"
                    }
                  }
                ],
                "sentiment": {
                  "positive": 0.08,
                  "neutral": 0.74,
                  "negative": 0.18,
                  "global": "neutral"
                }
              },
              {
                "author": "sudevsen",
                "text": "Love can travel through time and space",
                "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Love can travel through time and space&lt;/p&gt;\n&lt;/div&gt;",
                "ups": 73,
                "replies": [
                  {
                    "author": "I_am_so_lost_hello",
                    "text": "I say this everytime it comes up but the movie didn't imply love could PHYSICALLY travel through space.\n\nIt was more that our love for eachother forms connections that pushes us forward. Without his connection with his daughter McConaughey wouldn't have been able to communicate with her through morse code, and if Hathaway had followed her love instincts they would've gone to the right planet first. Even though neither of those actually featured love being a physical force, the time traveling message was done by future humans or aliens.",
                    "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;I say this everytime it comes up but the movie didn&amp;#39;t imply love could PHYSICALLY travel through space.&lt;/p&gt;\n\n&lt;p&gt;It was more that our love for eachother forms connections that pushes us forward. Without his connection with his daughter McConaughey wouldn&amp;#39;t have been able to communicate with her through morse code, and if Hathaway had followed her love instincts they would&amp;#39;ve gone to the right planet first. Even though neither of those actually featured love being a physical force, the time traveling message was done by future humans or aliens.&lt;/p&gt;\n&lt;/div&gt;",
                    "ups": 64,
                    "replies": [
                      {
                        "author": "[deleted]",
                        "text": "I agree.",
                        "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree.&lt;/p&gt;\n&lt;/div&gt;",
                        "ups": 3,
                        "sentiment": {
                          "positive": 0.02,
                          "neutral": 0.97,
                          "negative": 0.01,
                          "global": "neutral"
                        }
                      }
                    ],
                    "sentiment": {
                      "positive": 0.51,
                      "neutral": 0.04,
                      "negative": 0.45,
                      "global": "mixed"
                    }
                  }
                ],
                "sentiment": {
                  "positive": 1,
                  "neutral": 0,
                  "negative": 0,
                  "global": "positive"
                }
              },
              {
                "author": "MoonMan997",
                "text": "Yep and it's still his weakest received film critically largely due to those reasons.\n\nIt was admittedly pretty clumsy with it in parts, I love it despite that though.",
                "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep and it&amp;#39;s still his weakest received film critically largely due to those reasons.&lt;/p&gt;\n\n&lt;p&gt;It was admittedly pretty clumsy with it in parts, I love it despite that though.&lt;/p&gt;\n&lt;/div&gt;",
                "ups": 8,
                "replies": [],
                "sentiment": {
                  "positive": 0.46,
                  "neutral": 0,
                  "negative": 0.54,
                  "global": "mixed"
                }
              },
              {
                "author": "ninelives1",
                "text": "It talked at you about heart and soul, but that doesn't mean it had heart and soul.",
                "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;It talked at you about heart and soul, but that doesn&amp;#39;t mean it had heart and soul.&lt;/p&gt;\n&lt;/div&gt;",
                "ups": 10,
                "replies": [],
                "sentiment": {
                  "positive": 0.09,
                  "neutral": 0.86,
                  "negative": 0.05,
                  "global": "neutral"
                }
              },
              {
                "author": "Astarax",
                "text": "It had some pretty cringe dialogue though. I'm a fan of Interstellar, don't get me wrong, but it is often a movie that gets quoted as being so incredibly good, while it still has a lot of flaws that often get overlooked.",
                "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;It had some pretty cringe dialogue though. I&amp;#39;m a fan of Interstellar, don&amp;#39;t get me wrong, but it is often a movie that gets quoted as being so incredibly good, while it still has a lot of flaws that often get overlooked.&lt;/p&gt;\n&lt;/div&gt;",
                "ups": 10,
                "replies": [
                  {
                    "author": "SQUID_FUCKER",
                    "text": "&gt; while it still has a lot of flaws that often get overlooked.\n\nThis is one of my biggest issues with this subreddit in general.  People will bend over backwards to defend and ignore the flaws in certain films while absolutely eviscerating other films for the most mundane aspects and smallest details.",
                    "textHTML": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;while it still has a lot of flaws that often get overlooked.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is one of my biggest issues with this subreddit in general.  People will bend over backwards to defend and ignore the flaws in certain films while absolutely eviscerating other films for the most mundane aspects and smallest details.&lt;/p&gt;\n&lt;/div&gt;",
                    "ups": 5,
                    "replies": [
                      {
                        "author": "Boo_R4dley",
                        "text": "When so many people treat good films like they’re the greatest of all time it’s bound to happen.",
                        "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;When so many people treat good films like they’re the greatest of all time it’s bound to happen.&lt;/p&gt;\n&lt;/div&gt;",
                        "ups": 3,
                        "sentiment": {
                          "positive": 0.97,
                          "neutral": 0.03,
                          "negative": 0,
                          "global": "positive"
                        }
                      }
                    ],
                    "sentiment": {
                      "positive": 0,
                      "neutral": 0,
                      "negative": 1,
                      "global": "negative"
                    }
                  }
                ],
                "sentiment": {
                  "positive": 0.12,
                  "neutral": 0.01,
                  "negative": 0.87,
                  "global": "negative"
                }
              },
              {
                "author": "Nocturnal_animal808",
                "text": "Interstellar tried to have heart and soul. Interstellar felt like it was made by a robot that didn't actually know how human emotions worked so it was just using its best estimate.",
                "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Interstellar tried to have heart and soul. Interstellar felt like it was made by a robot that didn&amp;#39;t actually know how human emotions worked so it was just using its best estimate.&lt;/p&gt;\n&lt;/div&gt;",
                "ups": 27,
                "replies": [
                  {
                    "author": "Pants_for_Bears",
                    "text": "Gotta disagree there. That film genuinely moved me in a way few films do.",
                    "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;Gotta disagree there. That film genuinely moved me in a way few films do.&lt;/p&gt;\n&lt;/div&gt;",
                    "ups": 97,
                    "replies": [],
                    "sentiment": {
                      "positive": 0.26,
                      "neutral": 0.29,
                      "negative": 0.45,
                      "global": "mixed"
                    }
                  },
                  {
                    "author": "SQUID_FUCKER",
                    "text": "\"TARS, buddy, set your emotional response to 80%\"  \n  \n\"The answer is love Coop.\"  \n  \n\"...better make it 75.\"",
                    "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;TARS, buddy, set your emotional response to 80%&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;The answer is love Coop.&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;...better make it 75.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;",
                    "ups": 23,
                    "replies": [],
                    "sentiment": {
                      "positive": 0.91,
                      "neutral": 0.09,
                      "negative": 0,
                      "global": "positive"
                    }
                  },
                  {
                    "author": "[deleted]",
                    "text": "I'd say the audience reception to Interstellar is a testament to that being untrue. \n\nAudiences resonated with the film much more bevause of its emotional aspect.\n\nIt's why Interstellar has far higher audience scores than Dunkirk, despite Dunkirk being far more critically acclaimed.\n\nThere's also The Dark Knight trilogy. For all its flaws, the handling of emotions isn't one of them.",
                    "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d say the audience reception to Interstellar is a testament to that being untrue. &lt;/p&gt;\n\n&lt;p&gt;Audiences resonated with the film much more bevause of its emotional aspect.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s why Interstellar has far higher audience scores than Dunkirk, despite Dunkirk being far more critically acclaimed.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s also The Dark Knight trilogy. For all its flaws, the handling of emotions isn&amp;#39;t one of them.&lt;/p&gt;\n&lt;/div&gt;",
                    "ups": 24,
                    "replies": [],
                    "sentiment": {
                      "positive": 0.25,
                      "neutral": 0.06,
                      "negative": 0.69,
                      "global": "mixed"
                    }
                  }
                ],
                "sentiment": {
                  "positive": 0.98,
                  "neutral": 0,
                  "negative": 0.02,
                  "global": "positive"
                }
              }
            ],
            "sentiment": {
              "positive": 0.56,
              "neutral": 0.37,
              "negative": 0.07,
              "global": "positive"
            }
          }
        ],
        "sentiment": {
          "positive": 0.9,
          "neutral": 0.01,
          "negative": 0.09,
          "global": "positive"
        }
      },
      {
        "author": "xenobuzz",
        "text": "It's been funny to watch people come to this realization.  For me, it was \"Inception.\"  Loved the concept, construction and execution.  Felt NOTHING at the end.\n\nIMHO, his best film is \"The Prestige\", because that story perfectly fits his approach to film-making.",
        "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s been funny to watch people come to this realization.  For me, it was &amp;quot;Inception.&amp;quot;  Loved the concept, construction and execution.  Felt NOTHING at the end.&lt;/p&gt;\n\n&lt;p&gt;IMHO, his best film is &amp;quot;The Prestige&amp;quot;, because that story perfectly fits his approach to film-making.&lt;/p&gt;\n&lt;/div&gt;",
        "ups": 7,
        "sentiment": {
          "positive": 0.75,
          "neutral": 0.03,
          "negative": 0.22,
          "global": "mixed"
        }
      },
      {
        "author": "Rayhann",
        "text": "and pretty much why this movie was incredible to watch\n\nIt's a technically superb film like Dunkirk or 1917 (with the latter also being very emotional a times but still primarily a cinematic spectacle). With a concept driven narrative that was engaging and fun to *try* to follow. Nolan was completely indulgent with himself artistically here and on Dunkirk.\n\nIf I have to be honest, IGN's review summed it up the best. I know... yes, IGN.",
        "textHTML": "&lt;div class=\"md\"&gt;&lt;p&gt;and pretty much why this movie was incredible to watch&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a technically superb film like Dunkirk or 1917 (with the latter also being very emotional a times but still primarily a cinematic spectacle). With a concept driven narrative that was engaging and fun to &lt;em&gt;try&lt;/em&gt; to follow. Nolan was completely indulgent with himself artistically here and on Dunkirk.&lt;/p&gt;\n\n&lt;p&gt;If I have to be honest, IGN&amp;#39;s review summed it up the best. I know... yes, IGN.&lt;/p&gt;\n&lt;/div&gt;",
        "ups": 2,
        "sentiment": {
          "positive": 0.79,
          "neutral": 0.04,
          "negative": 0.17,
          "global": "mixed"
        }
      }
    ],
    "sentiment": {
      "positive": 0.44,
      "neutral": 0.03,
      "negative": 0.53,
      "global": "mixed"
    }
  }
]
